; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared2 - mode
	infrared1 - mode
	spectrograph0 - mode
	thermograph3 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation4 - direction
	Star1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 107)
	(= (data Phenomenon5 infrared2) 120)
	(= (data Star6 infrared2) 53)
	(= (data Planet7 infrared2) 77)
	(= (data Star8 infrared2) 139)
	(= (data Planet9 infrared2) 221)
	(= (data Planet10 infrared2) 264)
	(= (data Star11 infrared2) 12)
	(= (data Planet12 infrared2) 272)
	(= (data Planet13 infrared2) 10)
	(= (data Star14 infrared2) 62)
	(= (data Phenomenon5 infrared1) 161)
	(= (data Star6 infrared1) 220)
	(= (data Planet7 infrared1) 73)
	(= (data Star8 infrared1) 56)
	(= (data Planet9 infrared1) 96)
	(= (data Planet10 infrared1) 126)
	(= (data Star11 infrared1) 179)
	(= (data Planet12 infrared1) 85)
	(= (data Planet13 infrared1) 193)
	(= (data Star14 infrared1) 42)
	(= (data Phenomenon5 spectrograph0) 226)
	(= (data Star6 spectrograph0) 205)
	(= (data Planet7 spectrograph0) 114)
	(= (data Star8 spectrograph0) 179)
	(= (data Planet9 spectrograph0) 183)
	(= (data Planet10 spectrograph0) 83)
	(= (data Star11 spectrograph0) 12)
	(= (data Planet12 spectrograph0) 15)
	(= (data Planet13 spectrograph0) 85)
	(= (data Star14 spectrograph0) 51)
	(= (data Phenomenon5 thermograph3) 155)
	(= (data Star6 thermograph3) 231)
	(= (data Planet7 thermograph3) 180)
	(= (data Star8 thermograph3) 153)
	(= (data Planet9 thermograph3) 50)
	(= (data Planet10 thermograph3) 265)
	(= (data Star11 thermograph3) 276)
	(= (data Planet12 thermograph3) 159)
	(= (data Planet13 thermograph3) 101)
	(= (data Star14 thermograph3) 82)
	(= (slew_time GroundStation3 GroundStation0) 47.51)
	(= (slew_time GroundStation0 GroundStation3) 47.51)
	(= (slew_time GroundStation3 Star1) 22.7)
	(= (slew_time Star1 GroundStation3) 22.7)
	(= (slew_time GroundStation3 Star2) 28.61)
	(= (slew_time Star2 GroundStation3) 28.61)
	(= (slew_time Star2 GroundStation0) 24.23)
	(= (slew_time GroundStation0 Star2) 24.23)
	(= (slew_time Star2 Star1) 41.07)
	(= (slew_time Star1 Star2) 41.07)
	(= (slew_time GroundStation4 GroundStation0) 43.51)
	(= (slew_time GroundStation0 GroundStation4) 43.51)
	(= (slew_time GroundStation4 Star1) 35.88)
	(= (slew_time Star1 GroundStation4) 35.88)
	(= (slew_time GroundStation4 Star2) 75.9)
	(= (slew_time Star2 GroundStation4) 75.9)
	(= (slew_time GroundStation4 GroundStation3) 25.11)
	(= (slew_time GroundStation3 GroundStation4) 25.11)
	(= (slew_time Star1 GroundStation0) 11.97)
	(= (slew_time GroundStation0 Star1) 11.97)
	(= (slew_time Phenomenon5 GroundStation0) 12.73)
	(= (slew_time GroundStation0 Phenomenon5) 12.73)
	(= (slew_time Phenomenon5 Star1) 31.04)
	(= (slew_time Star1 Phenomenon5) 31.04)
	(= (slew_time Phenomenon5 Star2) 2.057)
	(= (slew_time Star2 Phenomenon5) 2.057)
	(= (slew_time Phenomenon5 GroundStation3) 62.17)
	(= (slew_time GroundStation3 Phenomenon5) 62.17)
	(= (slew_time Phenomenon5 GroundStation4) 0.4658)
	(= (slew_time GroundStation4 Phenomenon5) 0.4658)
	(= (slew_time Star6 GroundStation0) 76.52)
	(= (slew_time GroundStation0 Star6) 76.52)
	(= (slew_time Star6 Star1) 52.18)
	(= (slew_time Star1 Star6) 52.18)
	(= (slew_time Star6 Star2) 83.96)
	(= (slew_time Star2 Star6) 83.96)
	(= (slew_time Star6 GroundStation3) 60.06)
	(= (slew_time GroundStation3 Star6) 60.06)
	(= (slew_time Star6 GroundStation4) 46.4)
	(= (slew_time GroundStation4 Star6) 46.4)
	(= (slew_time Star6 Phenomenon5) 67.51)
	(= (slew_time Phenomenon5 Star6) 67.51)
	(= (slew_time Planet7 GroundStation0) 30.39)
	(= (slew_time GroundStation0 Planet7) 30.39)
	(= (slew_time Planet7 Star1) 46.98)
	(= (slew_time Star1 Planet7) 46.98)
	(= (slew_time Planet7 Star2) 32.22)
	(= (slew_time Star2 Planet7) 32.22)
	(= (slew_time Planet7 GroundStation3) 57.34)
	(= (slew_time GroundStation3 Planet7) 57.34)
	(= (slew_time Planet7 GroundStation4) 71.87)
	(= (slew_time GroundStation4 Planet7) 71.87)
	(= (slew_time Planet7 Phenomenon5) 33.72)
	(= (slew_time Phenomenon5 Planet7) 33.72)
	(= (slew_time Planet7 Star6) 9.619)
	(= (slew_time Star6 Planet7) 9.619)
	(= (slew_time Star8 GroundStation0) 29.52)
	(= (slew_time GroundStation0 Star8) 29.52)
	(= (slew_time Star8 Star1) 33.95)
	(= (slew_time Star1 Star8) 33.95)
	(= (slew_time Star8 Star2) 58.22)
	(= (slew_time Star2 Star8) 58.22)
	(= (slew_time Star8 GroundStation3) 20.4)
	(= (slew_time GroundStation3 Star8) 20.4)
	(= (slew_time Star8 GroundStation4) 6.228)
	(= (slew_time GroundStation4 Star8) 6.228)
	(= (slew_time Star8 Phenomenon5) 76.96)
	(= (slew_time Phenomenon5 Star8) 76.96)
	(= (slew_time Star8 Star6) 8.615)
	(= (slew_time Star6 Star8) 8.615)
	(= (slew_time Star8 Planet7) 38.88)
	(= (slew_time Planet7 Star8) 38.88)
	(= (slew_time Planet9 GroundStation0) 78.91)
	(= (slew_time GroundStation0 Planet9) 78.91)
	(= (slew_time Planet9 Star1) 35.68)
	(= (slew_time Star1 Planet9) 35.68)
	(= (slew_time Planet9 Star2) 54.01)
	(= (slew_time Star2 Planet9) 54.01)
	(= (slew_time Planet9 GroundStation3) 39)
	(= (slew_time GroundStation3 Planet9) 39)
	(= (slew_time Planet9 GroundStation4) 60.25)
	(= (slew_time GroundStation4 Planet9) 60.25)
	(= (slew_time Planet9 Phenomenon5) 40.48)
	(= (slew_time Phenomenon5 Planet9) 40.48)
	(= (slew_time Planet9 Star6) 33.96)
	(= (slew_time Star6 Planet9) 33.96)
	(= (slew_time Planet9 Planet7) 64.18)
	(= (slew_time Planet7 Planet9) 64.18)
	(= (slew_time Planet9 Star8) 30.71)
	(= (slew_time Star8 Planet9) 30.71)
	(= (slew_time Planet10 GroundStation0) 27.79)
	(= (slew_time GroundStation0 Planet10) 27.79)
	(= (slew_time Planet10 Star1) 16.23)
	(= (slew_time Star1 Planet10) 16.23)
	(= (slew_time Planet10 Star2) 66.13)
	(= (slew_time Star2 Planet10) 66.13)
	(= (slew_time Planet10 GroundStation3) 15.24)
	(= (slew_time GroundStation3 Planet10) 15.24)
	(= (slew_time Planet10 GroundStation4) 44.6)
	(= (slew_time GroundStation4 Planet10) 44.6)
	(= (slew_time Planet10 Phenomenon5) 3.289)
	(= (slew_time Phenomenon5 Planet10) 3.289)
	(= (slew_time Planet10 Star6) 22.3)
	(= (slew_time Star6 Planet10) 22.3)
	(= (slew_time Planet10 Planet7) 0.555)
	(= (slew_time Planet7 Planet10) 0.555)
	(= (slew_time Planet10 Star8) 24.57)
	(= (slew_time Star8 Planet10) 24.57)
	(= (slew_time Planet10 Planet9) 38.26)
	(= (slew_time Planet9 Planet10) 38.26)
	(= (slew_time Star11 GroundStation0) 12.28)
	(= (slew_time GroundStation0 Star11) 12.28)
	(= (slew_time Star11 Star1) 74.07)
	(= (slew_time Star1 Star11) 74.07)
	(= (slew_time Star11 Star2) 54.44)
	(= (slew_time Star2 Star11) 54.44)
	(= (slew_time Star11 GroundStation3) 47.82)
	(= (slew_time GroundStation3 Star11) 47.82)
	(= (slew_time Star11 GroundStation4) 27.61)
	(= (slew_time GroundStation4 Star11) 27.61)
	(= (slew_time Star11 Phenomenon5) 77.62)
	(= (slew_time Phenomenon5 Star11) 77.62)
	(= (slew_time Star11 Star6) 28.65)
	(= (slew_time Star6 Star11) 28.65)
	(= (slew_time Star11 Planet7) 77.82)
	(= (slew_time Planet7 Star11) 77.82)
	(= (slew_time Star11 Star8) 68.71)
	(= (slew_time Star8 Star11) 68.71)
	(= (slew_time Star11 Planet9) 24.52)
	(= (slew_time Planet9 Star11) 24.52)
	(= (slew_time Star11 Planet10) 12.89)
	(= (slew_time Planet10 Star11) 12.89)
	(= (slew_time Planet12 GroundStation0) 29.56)
	(= (slew_time GroundStation0 Planet12) 29.56)
	(= (slew_time Planet12 Star1) 0.5398)
	(= (slew_time Star1 Planet12) 0.5398)
	(= (slew_time Planet12 Star2) 8.769)
	(= (slew_time Star2 Planet12) 8.769)
	(= (slew_time Planet12 GroundStation3) 6.076)
	(= (slew_time GroundStation3 Planet12) 6.076)
	(= (slew_time Planet12 GroundStation4) 24.45)
	(= (slew_time GroundStation4 Planet12) 24.45)
	(= (slew_time Planet12 Phenomenon5) 28.37)
	(= (slew_time Phenomenon5 Planet12) 28.37)
	(= (slew_time Planet12 Star6) 6.249)
	(= (slew_time Star6 Planet12) 6.249)
	(= (slew_time Planet12 Planet7) 23.6)
	(= (slew_time Planet7 Planet12) 23.6)
	(= (slew_time Planet12 Star8) 36.64)
	(= (slew_time Star8 Planet12) 36.64)
	(= (slew_time Planet12 Planet9) 50.06)
	(= (slew_time Planet9 Planet12) 50.06)
	(= (slew_time Planet12 Planet10) 14.41)
	(= (slew_time Planet10 Planet12) 14.41)
	(= (slew_time Planet12 Star11) 49.33)
	(= (slew_time Star11 Planet12) 49.33)
	(= (slew_time Planet13 GroundStation0) 38.09)
	(= (slew_time GroundStation0 Planet13) 38.09)
	(= (slew_time Planet13 Star1) 56.39)
	(= (slew_time Star1 Planet13) 56.39)
	(= (slew_time Planet13 Star2) 6.653)
	(= (slew_time Star2 Planet13) 6.653)
	(= (slew_time Planet13 GroundStation3) 31.63)
	(= (slew_time GroundStation3 Planet13) 31.63)
	(= (slew_time Planet13 GroundStation4) 28.15)
	(= (slew_time GroundStation4 Planet13) 28.15)
	(= (slew_time Planet13 Phenomenon5) 33.17)
	(= (slew_time Phenomenon5 Planet13) 33.17)
	(= (slew_time Planet13 Star6) 17.02)
	(= (slew_time Star6 Planet13) 17.02)
	(= (slew_time Planet13 Planet7) 37.17)
	(= (slew_time Planet7 Planet13) 37.17)
	(= (slew_time Planet13 Star8) 17.26)
	(= (slew_time Star8 Planet13) 17.26)
	(= (slew_time Planet13 Planet9) 31.74)
	(= (slew_time Planet9 Planet13) 31.74)
	(= (slew_time Planet13 Planet10) 50.05)
	(= (slew_time Planet10 Planet13) 50.05)
	(= (slew_time Planet13 Star11) 64.05)
	(= (slew_time Star11 Planet13) 64.05)
	(= (slew_time Planet13 Planet12) 39.93)
	(= (slew_time Planet12 Planet13) 39.93)
	(= (slew_time Star14 GroundStation0) 68.21)
	(= (slew_time GroundStation0 Star14) 68.21)
	(= (slew_time Star14 Star1) 42.73)
	(= (slew_time Star1 Star14) 42.73)
	(= (slew_time Star14 Star2) 68.03)
	(= (slew_time Star2 Star14) 68.03)
	(= (slew_time Star14 GroundStation3) 23.42)
	(= (slew_time GroundStation3 Star14) 23.42)
	(= (slew_time Star14 GroundStation4) 19.82)
	(= (slew_time GroundStation4 Star14) 19.82)
	(= (slew_time Star14 Phenomenon5) 10.78)
	(= (slew_time Phenomenon5 Star14) 10.78)
	(= (slew_time Star14 Star6) 20.82)
	(= (slew_time Star6 Star14) 20.82)
	(= (slew_time Star14 Planet7) 4.461)
	(= (slew_time Planet7 Star14) 4.461)
	(= (slew_time Star14 Star8) 40.28)
	(= (slew_time Star8 Star14) 40.28)
	(= (slew_time Star14 Planet9) 8.016)
	(= (slew_time Planet9 Star14) 8.016)
	(= (slew_time Star14 Planet10) 45.23)
	(= (slew_time Planet10 Star14) 45.23)
	(= (slew_time Star14 Star11) 37.8)
	(= (slew_time Star11 Star14) 37.8)
	(= (slew_time Star14 Planet12) 35.32)
	(= (slew_time Planet12 Star14) 35.32)
	(= (slew_time Star14 Planet13) 29.9)
	(= (slew_time Planet13 Star14) 29.9)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star6 thermograph3)
	(have_image Planet7 spectrograph0)
	(have_image Star8 thermograph3)
	(have_image Planet10 thermograph3)
	(have_image Planet13 thermograph3)
	(have_image Star14 spectrograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 planet10 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 107 to 84.7, (fuel-used) from 0 to 22.3
   goals met: 0 of 6
2. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 84.7 to 84.145, (fuel-used) from 22.3 to 22.855
   goals met: 0 of 6
3. (turn_to satellite0 planet10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 84.145 to 83.59, (fuel-used) from 22.855 to 23.41
   goals met: 0 of 6
4. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 83.59 to 83.035, (fuel-used) from 23.41 to 23.965
   goals met: 0 of 6
5. (turn_to satellite0 planet10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 83.035 to 82.48, (fuel-used) from 23.965 to 24.52
   goals met: 0 of 6
6. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 82.48 to 81.925, (fuel-used) from 24.52 to 25.075
   goals met: 0 of 6
7. (turn_to satellite0 star14 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star14)
   changed: (fuel satellite0) from 81.925 to 77.464, (fuel-used) from 25.075 to 29.536
   goals met: 0 of 6
8. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
9. (turn_to satellite0 groundstation4 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation4)
   changed: (fuel satellite0) from 77.464 to 57.644, (fuel-used) from 29.536 to 49.356
   goals met: 0 of 6
10. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 6
11. (turn_to satellite0 star8 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 57.644 to 51.416, (fuel-used) from 49.356 to 55.584
   goals met: 0 of 6
12. (take_image satellite0 star8 instrument1 thermograph3)
   added: (have_image star8 thermograph3)
   changed: (data_capacity satellite0) from 1000 to 847, (data-stored) from 0 to 153
   goals met: 1 of 6
13. (turn_to satellite0 groundstation4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation4)
   changed: (fuel satellite0) from 51.416 to 45.188, (fuel-used) from 55.584 to 61.812
   goals met: 1 of 6
14. (turn_to satellite0 phenomenon5 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 45.188 to 44.7222, (fuel-used) from 61.812 to 62.2778
   goals met: 1 of 6
15. (turn_to satellite0 star14 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star14)
   changed: (fuel satellite0) from 44.7222 to 33.9422, (fuel-used) from 62.2778 to 73.0578
   goals met: 1 of 6
16. (take_image satellite0 star14 instrument1 spectrograph0)
   added: (have_image star14 spectrograph0)
   changed: (data_capacity satellite0) from 847 to 796, (data-stored) from 153 to 204
   goals met: 2 of 6
17. (turn_to satellite0 planet7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 33.9422 to 29.4812, (fuel-used) from 73.0578 to 77.5188
   goals met: 2 of 6
18. (take_image satellite0 planet7 instrument1 spectrograph0)
   added: (have_image planet7 spectrograph0)
   changed: (data_capacity satellite0) from 796 to 682, (data-stored) from 204 to 318
   goals met: 3 of 6
19. (turn_to satellite0 planet10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 29.4812 to 28.9262, (fuel-used) from 77.5188 to 78.0738
   goals met: 3 of 6
20. (take_image satellite0 planet10 instrument1 thermograph3)
   added: (have_image planet10 thermograph3)
   changed: (data_capacity satellite0) from 682 to 417, (data-stored) from 318 to 583
   goals met: 4 of 6
21. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 28.9262 to 28.3712, (fuel-used) from 78.0738 to 78.6288
   goals met: 4 of 6
22. (turn_to satellite0 planet10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 28.3712 to 27.8162, (fuel-used) from 78.6288 to 79.1838
   goals met: 4 of 6
23. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 27.8162 to 27.2612, (fuel-used) from 79.1838 to 79.7388
   goals met: 4 of 6
24. (turn_to satellite0 star6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 27.2612 to 17.6422, (fuel-used) from 79.7388 to 89.3578
   goals met: 4 of 6
25. (take_image satellite0 star6 instrument1 thermograph3)
   added: (have_image star6 thermograph3)
   changed: (data_capacity satellite0) from 417 to 186, (data-stored) from 583 to 814
   goals met: 5 of 6
26. (turn_to satellite0 planet13 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet13)
   changed: (fuel satellite0) from 17.6422 to 0.6222, (fuel-used) from 89.3578 to 106.378
   goals met: 5 of 6
27. (take_image satellite0 planet13 instrument1 thermograph3)
   added: (have_image planet13 thermograph3)
   changed: (data_capacity satellite0) from 186 to 85, (data-stored) from 814 to 915
   goals met: 6 of 6
